In [1]:
import pandas as pd;
import numpy as np;

obj11 = pd.Series(['a', 'b', 'c']);
obj11

0    a
1    b
2    c
dtype: object

In [2]:
obj12 = pd.Series(['a', 'b', 'c'], index=[11, 12, 13]);
obj12

11    a
12    b
13    c
dtype: object

In [12]:
obj12[11]
obj12[11] = 'Z'
obj12[11]

'Z'

In [4]:
obj13 = pd.Series({'ID':4001, 'Name':'M. Irfan Afzal', 'FatherName':'M.Afzal'});

obj13

ID                      4001
Name          M. Irfan Afzal
FatherName           M.Afzal
dtype: object

In [6]:
obj13.index

Index(['ID', 'Name', 'FatherName'], dtype='object')

In [7]:
obj13.values

array([4001, 'M. Irfan Afzal', 'M.Afzal'], dtype=object)

In [9]:
obj13.name = 'StudentData';
obj13.index.name = 'S.No';
obj13

S.No
ID                      4001
Name          M. Irfan Afzal
FatherName           M.Afzal
Name: StudentData, dtype: object

In [21]:
frame11 = pd.DataFrame({
    'day': [1,2,3,4,5],
    'temp': [20,10,15,18,16],
    'windy': [30,5,45,5,10],
    'rainy': [True, False,False,True,False]
});
frame11.to_excel('Folder/LocalWeather.xlsx', sheet_name='sheet1');
frame11

   day  temp  windy  rainy
0    1    20     30   True
1    2    10      5  False
2    3    15     45  False
3    4    18      5   True
4    5    16     10  False

In [16]:
#
frame12 = pd.DataFrame([
    {'day':1, 'temp':23, 'windy':34, 'rainy': True},
    {'day':2, 'temp':13, 'windy':44, 'rainy': False},
    {'day':3, 'temp':33, 'windy':14, 'rainy': True},
]);
frame12

   day  temp  windy  rainy
0    1    23     34   True
1    2    13     44  False
2    3    33     14   True

In [17]:
#tuple based
frame13 = pd.DataFrame([
    (1, 22, 23),
    (2, 28, 40),
    (3, 32, 43),
], columns=['day','temp','windy']);
frame13

   day  temp  windy
0    1    22     23
1    2    28     40
2    3    32     43

In [23]:
frame14 = pd.read_excel('Folder/weather.xlsx');
frame14

   Month  Rainfall (Inches)  Temperature (0F)
0    Jan                 32                20
1    Feb                 25                21
2    Mar                 21                36
3    Apr                 24                38
4    May                 19                40
5    Jun                 18                43
6    Jul                 12                49
7    Aug                 11                46
8    Sep                 16                28
9    Oct                 19                18
10   Nov                 21                11
11   Dec                 22                 6

In [36]:
res = frame14[["Month", "Rainfall (Inches)"]];

res

   Month  Rainfall (Inches)
0    Jan                 32
1    Feb                 25
2    Mar                 21
3    Apr                 24
4    May                 19
5    Jun                 18
6    Jul                 12
7    Aug                 11
8    Sep                 16
9    Oct                 19
10   Nov                 21
11   Dec                 22

In [37]:
frame14.head()

  Month  Rainfall (Inches)  Temperature (0F)
0   Jan                 32                20
1   Feb                 25                21
2   Mar                 21                36
3   Apr                 24                38
4   May                 19                40

In [38]:
frame14.tail(3)

   Month  Rainfall (Inches)  Temperature (0F)
9    Oct                 19                18
10   Nov                 21                11
11   Dec                 22                 6

In [40]:
frame14.columns

Index(['Month', 'Rainfall (Inches)', 'Temperature (0F)'], dtype='object')

In [41]:
frame14["Rainfall (Inches)"].max()

32

In [42]:
frame14["Rainfall (Inches)"].min()

11

In [43]:
frame14["Rainfall (Inches)"].mean()

20.0

In [44]:
frame14.describe()

       Rainfall (Inches)  Temperature (0F)
count          12.000000         12.000000
mean           20.000000         29.666667
std             5.704862         14.304057
min            11.000000          6.000000
25%            17.500000         19.500000
50%            20.000000         32.000000
75%            22.500000         40.750000
max            32.000000         49.000000

In [45]:
frame14.loc[4]

Month                May
Rainfall (Inches)     19
Temperature (0F)      40
Name: 4, dtype: object

In [57]:
frame14['newCloumn'] = np.arange(12,);
frame14

   Month  Rainfall (Inches)  Temperature (0F)  newCloumn
0    Jan                 32                20          0
1    Feb                 25                21          1
2    Mar                 21                36          2
3    Apr                 24                38          3
4    May                 19                40          4
5    Jun                 18                43          5
6    Jul                 12                49          6
7    Aug                 11                46          7
8    Sep                 16                28          8
9    Oct                 19                18          9
10   Nov                 21                11         10
11   Dec                 22                 6         11

In [58]:
del frame14['newCloumn'];
frame14

   Month  Rainfall (Inches)  Temperature (0F)
0    Jan                 32                20
1    Feb                 25                21
2    Mar                 21                36
3    Apr                 24                38
4    May                 19                40
5    Jun                 18                43
6    Jul                 12                49
7    Aug                 11                46
8    Sep                 16                28
9    Oct                 19                18
10   Nov                 21                11
11   Dec                 22                 6

In [59]:
frame14.T

                     0    1    2    3    4    5    6    7    8    9   10   11
Month              Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
Rainfall (Inches)   32   25   21   24   19   18   12   11   16   19   21   22
Temperature (0F)    20   21   36   38   40   43   49   46   28   18   11    6

In [66]:
frame14[["Month", "Rainfall (Inches)"]][frame14["Month"] == 'Feb']

  Month  Rainfall (Inches)
1   Feb                 25

In [67]:
frame14[frame14["Month"] == 'Feb']

  Month  Rainfall (Inches)  Temperature (0F)
1   Feb                 25                21

In [68]:
frame14[frame14["Temperature (0F)"] > 20]

  Month  Rainfall (Inches)  Temperature (0F)
1   Feb                 25                21
2   Mar                 21                36
3   Apr                 24                38
4   May                 19                40
5   Jun                 18                43
6   Jul                 12                49
7   Aug                 11                46
8   Sep                 16                28

In [73]:
frame14.shape

(12, 3)

In [74]:
row,column = frame14.shape
column

3

In [75]:
frame14.sort_values(by="Rainfall (Inches)")

   Month  Rainfall (Inches)  Temperature (0F)
7    Aug                 11                46
6    Jul                 12                49
8    Sep                 16                28
5    Jun                 18                43
4    May                 19                40
9    Oct                 19                18
2    Mar                 21                36
10   Nov                 21                11
11   Dec                 22                 6
3    Apr                 24                38
1    Feb                 25                21
0    Jan                 32                20

In [78]:
frame14[1:6]

  Month  Rainfall (Inches)  Temperature (0F)
1   Feb                 25                21
2   Mar                 21                36
3   Apr                 24                38
4   May                 19                40
5   Jun                 18                43

In [79]:
frame14[-5:-1]

   Month  Rainfall (Inches)  Temperature (0F)
7    Aug                 11                46
8    Sep                 16                28
9    Oct                 19                18
10   Nov                 21                11

In [82]:
frame21 = pd.DataFrame(np.random.randn(4,4), index=pd.date_range('20100101', periods=4), columns=list('ABCD'));
print(frame21)
frame22 = pd.DataFrame(np.random.randn(4,4), index=pd.date_range('20100101', periods=4), columns=list('ABCD'));
print(frame22)

print(frame21 + frame22);

                   A         B         C         D
2010-01-01 -0.162006 -0.477330  0.056421 -0.009022
2010-01-02  0.579233  0.116440 -2.105131 -2.059984
2010-01-03 -0.983564  0.310580  0.112281 -1.945340
2010-01-04 -2.408690  1.738745 -0.723309 -0.227319
                   A         B         C         D
2010-01-01 -0.314298 -0.552504  1.077710 -0.458206
2010-01-02 -0.664961  0.192195 -1.984333 -0.283806
2010-01-03 -1.508414  2.089255  1.122723  0.193682
2010-01-04 -0.321151  1.438184  1.052497  1.174075
                   A         B         C         D
2010-01-01 -0.476303 -1.029834  1.134131 -0.467228
2010-01-02 -0.085728  0.308635 -4.089464 -2.343790
2010-01-03 -2.491978  2.399835  1.235004 -1.751658
2010-01-04 -2.729841  3.176929  0.329188  0.946755